dimitarm1/stm8_projects/main.c
static int key_states[5] = {-1,-1,-1, -1, -1};
static int last_key_states[5] = {-1,-1,-1, -1, -1};

/* Private function prototypes -----------------------------------------------*/
void push_note(int pitch, int duration);
void ProcessSensors(void);
void SystickDelay(__IO uint32_t nTime);
//void ping_status(void);
int ToBCD(int value);
void send_time(void);
void send_start(void);
void write_eeprom(void);
void read_eeprom(void);
void update_status(void);
void KeyPressed_0(void);
void KeyPressed_1(void);
void KeyPressed_2(void);
void KeyPressed_3();
void set_relay1(unsigned char state);
void set_relay2(unsigned char state);
void update_outputs(void);

/* Global variables ----------------------------------------------------------*/

__IO uint32_t Gv_SystickCounter;
#pragma location=0x1000 //Наш адрес в EEPROM/flash (в данном случае - начало еепромки)
__no_init  uint32_t eeprom_array[512];

/* Private functions ---------------------------------------------------------*/
void Delay(__IO uint32_t nTime)
{
  TimingDelay = nTime;

  while(TimingDelay != 0);
}

void show_digit(int digit){
	digit = digit & 0x0F;


}

int get_controller_status(int n){

	static int sts, data;
	// clear in fifo
	// send conmmand
	UART1_ClearFlag(UART1_FLAG_RXNE); // Flush input
//    while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET); // wAIT UNTIL TX BUFFER IS EMPTY
	UART1_SendData8(0x80 | ((n & 0x0f)<<3) | 0);
//    while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET); // wAIT UNTIL TX BUFFER IS EMPTY
//    delta = (delta + 1)& 0xff;
//	USART_SendData(USART1,delta);

//	USART_SendData(USART1,0x0f);
    SystickDelay(70);

    //read Rx buffer
    sts = UART1_GetFlagStatus(UART1_FLAG_RXNE);
    if(sts) {
    	data =  UART1_ReceiveData8();
    	//			while(1);
    	return (data);
	}
	return -1;
}
// Function to get controller's address
void get_address(void){
	int i, result;
	for (i = 0; i<16; i++){
		result = get_controller_status(i);
		if (result!=-1) break;
		SystickDelay(60);
	}
	controller_address = i;
}


/**
  * @brief  Configure system clock to run at 16Mhz
  * @param  None
  * @retval None
  */
static void CLK_Config(void)
{
    /* Initialization of the clock */
    /* Clock divider to HSI/1 */
    CLK_HSIPrescalerConfig(CLK_PRESCALER_HSIDIV1);
}

/**
  * @brief  Main program.
  * @param  None
  * @retval None
  */
int main(void)
{
  CLK_Config();
   /* Initialize I/Os in Output Mode */
  GPIO_Init(LED_GPIO_PORT, (GPIO_Pin_TypeDef)LED_GPIO_PINS, GPIO_MODE_OUT_PP_LOW_FAST);
  GPIO_Init(BUZZER_GPIO_PORT, (GPIO_Pin_TypeDef)BUZZER_GPIO_PINS, GPIO_MODE_OUT_PP_LOW_FAST);
  GPIO_Init(RELAY_GPIO_PORT, (GPIO_Pin_TypeDef)RELAY_GPIO_PINS, GPIO_MODE_OUT_PP_LOW_FAST);


//  while (1)
//  {
    /* Toggles LEDs */
//    GPIO_WriteReverse(LED_GPIO_PORT, (GPIO_Pin_TypeDef)LED_GPIO_PINS);
//    Delay(0xFFFF);
//  }

	spi_init();
	uart_init();

    TIM1_Config();
    TIM4_Config();

	
/*
 * commads:
 * 0 - status 0-free, 1-Working, 2-COOLING, 3-WAITING
 * 1 - start
 * 2 - set pre-time
 * 3 - set cool-time
 * 4 - stop - may be not implemented in some controllers
 * 5 - set main time
 */

	
	  push_note(F3,3);
	  push_note(E3,3);
	  push_note(C3,3);
	
	  digits[0] = 0;
	  digits[1] = 1;
	  digits[2] = 2;
	  prev_status = 0;

//	  while (1){
//		  while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) != RESET)
//			  USART_SendData(USART1,0x80 );
//	  }

	  read_eeprom();
	  if(!preset_pre_time || ! preset_cool_time){
		  preset_pre_time = 7;
		  preset_cool_time = 3;
		  controller_address = 14;
		  write_eeprom();
	  }

//	  if(controller_address == 15){
//		  display_data = 0xEAF;
//		  // Try to get controller address continuously
//		  get_address();
//		  if(controller_address != 15)write_eeprom();
//	  }

	  while (1)
	  {
//		  controller_address = 14;

/*		  if(controller_address >15){
			  display_data = 0xEAF;
			  // Try to get controller address continuously
			  get_address();
		  }
		  else*/
		  {
			  key_states[0] = (key_states[0] << 1) | 	(!!(GPIO_ReadInputPin(KEY1_GPIO_PORT, KEY1_GPIO_PIN))); // Start
			  key_states[1] = (key_states[1] << 1) | 	(!!(GPIO_ReadInputPin(KEY2_GPIO_PORT, KEY2_GPIO_PIN))); // -
			  key_states[2] = (key_states[2] << 1) | 	(!!(GPIO_ReadInputPin(KEY3_GPIO_PORT, KEY3_GPIO_PIN))); // +
//			  key_states[3] = (key_states[3] << 1) | 	(!!(GPIO_ReadInputPin(KEY4_GPIO_PORT, KEY4_GPIO_PIN))); // External start
//			  if(controller_address == 15){
//				  key_states[4] = (key_states[4] << 1) | 	(!!(GPIOA->IDR & GPIO_IDR_1)); // Coin switch
//			  }
			  ProcessSensors(); // Execute sensors related tasks
			  // Scan buttons

			  //ping_status(); // Get current status
//			  display_data = state + ((curr_status&0x0f)<<4);
//			  display_data =ping_counter;
//			  state = 30;
			  switch (state){
			  case state_show_time:
			  case state_set_time:
				  if(curr_status == STATUS_FREE ){
					  flash_mode = 0;
					  state = state_set_time;
					  display_data = ToBCD(main_time);
				  } else {

					  state = state_show_time;
					  //				  time_to_set = 0;
					  display_data = ToBCD(main_time);
					  if(curr_status == STATUS_WAITING ){
						  flash_mode = 1; // DP flashing
					  } else  if(curr_status == STATUS_WORKING ){
						  flash_mode = 2; // DP cycling
					  } else  if(curr_status == STATUS_COOLING ){
						  flash_mode = 3; // All flashing
					  } else {
//						  controller_address = 16;
						  if((flash_counter/0x80)&1){
							  display_data = 0xEEE;
						  }

//						  display_data = ping_counter;
						 // flash_mode = 3; // All flashing
					  }

				  }

				  break;
			  case state_show_hours:

				  if( flash_mode != 3){
					  flash_mode = 3; // All flashing
					  flash_counter_prev = flash_counter = 0;
				  }
				  {
					  int index = (counter_hours)%4;
					  if(index<3){
						  display_data = 0xF00 | ToBCD(work_hours[index]);
					  }
					  else {
						  display_data = 0xFFF;
					  }
//					  if (TEST_TKEY(0)||TEST_TKEY(1)){
//						  display_data = 0xFF1;
//					  } else{
//						  display_data = 0xFF0;
//					  }

					  if(flash_counter_prev != (flash_counter & 0x40)){
						  if(flash_counter_prev) counter_hours++;
						  flash_counter_prev = (flash_counter & 0x40);
					  }
				  }
				  break;
			  case state_enter_service:
				  display_data = service_mode|0xAF0;
				  flash_mode = 0;
				  break;

			  case state_clear_hours:
				  flash_mode = 3;
				  display_data = 0xFFC;
				  break;
			  case state_address:
				  flash_mode = 0;
				  if((flash_counter/0x80)&1){
					  if(controller_address !=15){ // Address 15 reserved for external control
						  display_data = controller_address;
					  }
					  else {
						  display_data = 0xAAA;
					  }
				  } else {
					  display_data = 0xFFA;
				  }
				  break;
			  case state_pre_time:
				  flash_mode = 2;
				  display_data = 0x3F0 | preset_pre_time;;
				  break;
			  case state_cool_time:
				  flash_mode = 2;
				  display_data = 0x4F0 | preset_cool_time;
				  break;
			  case state_ext_mode:
				  flash_mode = 0;
				  display_data = 0x5F0;
				  break;
			  }
		  }
		  update_outputs();
		  SystickDelay(5);
	  }
}

void push_note(int pitch, int duration){

	end_note = (end_note + 1)&0x3F;
	pitches[end_note] = pitch;
	durations[end_note] = duration;
	TIM4->IER |= TIM4_IER_UIE; // Enable interrupt on update event
}

