dimitarm1/stm8_projects/main.c
void get_next_note(){

	if(start_note == end_note){
		TIM4->IER &= ~TIM4_IER_UIE; // Disable interrupt on update event
	} else {
		start_note = (start_note + 1)&0x3F;
		TIM4->ARR = pitches[start_note];
		buzz_counter = durations[start_note]*20000/ pitches[start_note];
	}
}

void clear_notes(){
	start_note = end_note = 0;
	buzz_counter = 0;
}

void TIM4_MyIRQHandler() {
	if(buzz_counter){
		buzz_counter--;
		GPIO_WriteReverse(BUZZER_GPIO_PORT, (GPIO_Pin_TypeDef)BUZZER_GPIO_PINS);
	}
	if(!buzz_counter )	get_next_note();
}

int ToBCD(int value){
	int digits[3];
	int result;
	digits[0] = value %10;
	digits[1] = (value/10) % 10;
	digits[2] = (value/100) % 10;
	result = digits[0] | (digits[1]<<4) | (digits[2]<<8);
	return result;
}

int FromBCD(int value){
	int digits[3];
	int result;
	digits[0] = value & 0x0F;
	digits[1] = (value>>4) & 0x0F;
	digits[2] = (value>>8) & 0x0F;
	result = digits[0] + digits[1]*10 + digits[2]*100;
	return result;
}




/**
  * @brief  Manage the activity on sensors when touched/released (example)
  * @param  None
  * @retval None
  */
void ProcessSensors(void)
{
	if(!last_key_states[0] != (!key_states[0]| !key_states[3]))
	{
		last_key_states[0] = !(!key_states[0]| !key_states[3]);
		if(!last_key_states[0]) KeyPressed_0();
	}
	if(!last_key_states[1] != !key_states[1])
	{
		last_key_states[1] = !!key_states[1];
		if(!last_key_states[1]) KeyPressed_1();
	}
	if(!last_key_states[2] != !key_states[2])
	{
		last_key_states[2] = !!key_states[2];
		if(!last_key_states[2]) KeyPressed_2();
	}
	if(!last_key_states[4] != !key_states[4])
		{
			last_key_states[4] = !!key_states[4];
			if(!last_key_states[4]) KeyPressed_3();
		}

	if ((!key_states[0]| !key_states[3]))
	{
		if((curr_status == STATUS_FREE))
		{
			if(start_counter< (START_COUNTER_TIME+ ENTER_SERVICE_DELAY + 6*SERVICE_NEXT_DELAY)) start_counter++;
			if(start_counter == START_COUNTER_TIME + ENTER_SERVICE_DELAY)
			{
				clear_notes();
				push_note(C2,4);
				push_note(E2,4);
				push_note(G2,4);
				push_note(C3,4);
				push_note(G2,4);
				push_note(C3,8);
				state = state_enter_service;
				service_mode = mode_clear_hours; // Clear Hours
			}
			else if(start_counter == START_COUNTER_TIME + ENTER_SERVICE_DELAY + 1*SERVICE_NEXT_DELAY){
				service_mode = mode_set_address; //
			}
			else if(start_counter == START_COUNTER_TIME + ENTER_SERVICE_DELAY + 2*SERVICE_NEXT_DELAY){
				service_mode = mode_set_pre_time; //
			}
			else if(start_counter == START_COUNTER_TIME + ENTER_SERVICE_DELAY + 3*SERVICE_NEXT_DELAY){
				service_mode = mode_set_cool_time; //
			}
		}
	}
	else
	{
		if(start_counter){
			if(state == state_show_hours){
				start_counter--;
				if(!start_counter){
					state = state_show_time;
				}
			}
			else if(state >= state_enter_service){
				if(state == state_enter_service){
					state = service_mode + state_enter_service;
				}
				//start_counter--;
				start_counter = 0;
			}
			else {
				start_counter--;

			}
		}
		if(prev_status != curr_status){
			if (prev_status == STATUS_WAITING && curr_status == STATUS_WORKING){
				work_hours[2]+=main_time;
				if(work_hours[2]>59){
					work_hours[2]=work_hours[2]-60;
					work_hours[1]++;
					if(work_hours[1]>99){
						work_hours[1] = 0;
						work_hours[0]++;
					}
				}
				write_eeprom();
			}
			prev_status = curr_status;

		}
		//    LED1_OFF;
	}

	// TKEY 1
	if (!key_states[2])
	{
//		LED2_ON;
	}
	else
	{
//		LED2_OFF;
	}


}


#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
//  LED1_OFF;
//  LED2_ON;
  for (;;)
  {
//    LED1_TOGGLE;
//    LED2_TOGGLE;
    SystickDelay(100);
  }
}
#endif


/**
  * @brief  Add a delay using the Systick
  * @param  nTime Delay in milliseconds.
  * @retval None
  */
void SystickDelay(__IO uint32_t nTime)
{

  Gv_SystickCounter = nTime;
  while (Gv_SystickCounter != 0)
  {
    // The Gv_SystickCounter variable is decremented every ms by the Systick interrupt routine
  }

}

void TimingDelay_Decrement(void)
{
	if (Gv_SystickCounter != 0x00)
	{
		Gv_SystickCounter--;
	}
	//TSL_tim_ProcessIT();

	if(++led_counter>6){
		led_counter = 0;
		digit_num++;
		flash_counter++;
		if(digit_num>2) digit_num = 0;
		// TODO: Use SPI to update display
		GPIOA->BSRR = GPIO_BSRR_BR_0  | GPIO_BSRR_BR_2; // Turn off the lights while changing them
		GPIOC->BSRR = GPIO_BSRR_BR_3;
		show_digit(((display_data & 0xFFF)& (0x0F<<(digit_num*4)))>>(digit_num*4));
		if(flash_mode < 3 ||(flash_counter & 0x40)){
			switch (digit_num){
			case 2:
				GPIOA->BSRR = GPIO_BSRR_BS_2 ;
				GPIOA->BSRR = GPIO_BSRR_BR_0 ;
				GPIOC->BSRR = GPIO_BSRR_BR_3;
				break;

			case 1:
				GPIOC->BSRR = GPIO_BSRR_BS_3 ;
				GPIOA->BSRR = GPIO_BSRR_BR_0 | GPIO_BSRR_BR_2;
				break;
			case 0:
			default:
				GPIOA->BSRR = GPIO_BSRR_BS_0 ;
				GPIOA->BSRR = GPIO_BSRR_BR_2;
				GPIOC->BSRR = GPIO_BSRR_BR_3;
				break;
			}
		}
		if (((flash_mode == 1)&& digit_num == 0 && (flash_counter & 0x40)) || ((flash_mode == 2) && (digit_num == 2))){
			GPIOC->BSRR = GPIO_BSRR_BS_0 | GPIO_BSRR_BS_1;
		}
		else
		{
			GPIOC->BSRR = GPIO_BSRR_BR_0 | GPIO_BSRR_BR_1;
		}
	}
	if(start_delay)start_delay--;
	if(Gv_miliseconds++>60000L){
		Gv_miliseconds = 0;
		if (pre_time)
		{
			pre_time--;
			if (pre_time == 0 && main_time != 0)
			{
				start_delay = 2000L;
			}
		}
		else if (main_time) {
			main_time--;
			minute_counter ++;
			if(main_time == 0){
				//play_message(2);
			}
		}
		else if (cool_time) cool_time--;
		//update_status();
	}
	if  (Gv_UART_Timeout){
		Gv_UART_Timeout--;
		if(! Gv_UART_Timeout) {
			rx_state = 0;
			pre_time_sent = 0, main_time_sent = 0, cool_time_sent = 0;
		}
	}
	update_status();
}


