dimitarm1/stm8_projects/main.c
void KeyPressed_0(void){//START Key(Left)

//	push_note(E2,2);
//	push_note(G2,2);
//	push_note(C3,2);
	if( curr_status == STATUS_WAITING ){
		clear_notes();

		push_note(C3,6);
		push_note(E3,4);
		Gv_miliseconds = 0;
		pre_time = 0;
		start_delay = 2000L;
		//send_start();
	}
	if((curr_status == STATUS_FREE || curr_status == STATUS_ERROR) ) {
		clear_notes();

		push_note(C3,6);
		{
			if (state > state_enter_service){
				// Write EEPROM
				if(state == state_clear_hours){
					work_hours[0] = 0;
					work_hours[1] = 0;
					work_hours[2] = 0;
				}
				write_eeprom();
				read_eeprom();
				start_counter = 0;
				flash_mode = 0;
				state = state_set_time;
			} else {
				start_counter = START_COUNTER_TIME;
				state = state_show_hours;
			}
		}
	}
}

void KeyPressed_2(void){ // +
	if(state == state_show_hours) {
		state = state_set_time;
		start_counter = 0;
	}
	if(state == state_set_time ){
		if(main_time < 25){
			pre_time = preset_pre_time;
			cool_time = preset_cool_time;
			main_time ++;
//			if((time_to_set & 0x0F)>9) time_to_set +=6;
		}
	}
	else if(state == state_show_time && curr_status == STATUS_WAITING)
	{
		if(main_time < 25)
		{
			main_time ++;
		}
	}
	else if(state > state_enter_service){
		start_counter = EXIT_SERVICE_TIME;
		switch (service_mode){
		case mode_set_address:
			if(controller_address<15) controller_address++;
			break;
		case mode_set_pre_time:
			if(preset_pre_time<9) preset_pre_time++;
			break;
		case mode_set_cool_time:
			if(preset_cool_time<9) preset_cool_time++;
			break;
		default:
			break;
		}
	}
	clear_notes();

	push_note(A3,8);
}
void KeyPressed_1(void){ // -
//	if(state == state_show_hours) {
//		state = state_set_time;
//		start_counter = 0;
//	}
	if(state == state_show_time && curr_status == STATUS_WAITING )
	{
		if(main_time) {
			main_time--;
		}
		if (main_time == 0)
		{
			pre_time = 0;
			cool_time = 0;
		}
	}else if(state > state_enter_service){
		start_counter = EXIT_SERVICE_TIME;
		switch (service_mode){
		case mode_set_address:
			if(controller_address) controller_address--;
			break;
		case mode_set_pre_time:
			if(preset_pre_time) preset_pre_time--;
			break;
		case mode_set_cool_time:
			if(preset_cool_time) preset_cool_time--;
			break;
		default:
			break;
		}
	}

//	if((time_to_set & 0x0F)>9) time_to_set -=6;
	clear_notes();

	push_note(A3,8);

}

void KeyPressed_3()
{
	if(main_time == 0 && controller_address)
	{
		pre_time = preset_pre_time;
		cool_time = preset_cool_time;
	}
	main_time += controller_address;
	if(main_time > 25)
	{
		main_time = 25;
	}

}

void set_relay2(unsigned char state)
{
	if (state && start_delay == 0)
	{
		 GPIOC->BSRR = GPIO_BSRR_BS_11 ;
	}
	else
	{
		 GPIOC->BSRR = GPIO_BSRR_BR_11 ;
	}
}

void set_relay1(unsigned char state)
{
	if (state )
	{
		 GPIOA->BSRR = GPIO_BSRR_BS_15;
	}
	else
	{
		 GPIOA->BSRR = GPIO_BSRR_BR_15;
	}
}

void update_status(void){
	if(pre_time) {
		curr_status = STATUS_WAITING;
		curr_time = pre_time;
	}
	else if(main_time) {
		curr_status = STATUS_WORKING;
		curr_time = main_time;
	}
	else if(cool_time) {
		curr_status = STATUS_COOLING;
		curr_time = cool_time;
		start_delay = 0;
	}
	else {
		curr_status = STATUS_FREE;
		curr_time = 0;
		start_delay = 0;
	}
}
void update_outputs(void){
	if( curr_status == STATUS_WAITING){
		set_relay1(0);
		set_relay2(0);
	}
	else if(curr_status == STATUS_WORKING){
		set_relay1(1);
		set_relay2(1);
	}
	else if(curr_status == STATUS_COOLING){
		set_relay1(0);
		set_relay2(1);
	}
	else {
		set_relay1(0);
		set_relay2(0);
	}
}


//void send_start(void){
//	// Ping solarium for status
//	if(controller_address >15){
//		curr_status = -1;
//		curr_time = 0;
//	} else {
//			while(USART_GetFlagStatus(USART1,USART_FLAG_RXNE))	USART_ReceiveData(USART1); // Flush input
//			while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET); // wAIT UNTIL TX BUFFER IS EMPTY
//
//			USART_SendData(USART1,0x80 | ((controller_address & 0x0f)<<3) | 1); //Command 1 == start
//			SystickDelay(2);
//			USART_SendData(USART1,0x55);
//	}
//}

void read_eeprom(void){
	int index = 0;
	flash_struct *flash_mem;
	uint32_t *p = (uint32_t *)eeprom_array;
	for(index = 0; index<512; index+=2){
		if(*(p + index)==0xFFFFFFFF) break;
	}
	if(index == 0){
		// Load defaults
		flash_mem = 0;
		preset_pre_time = 7;
		preset_cool_time = 3;
		controller_address = 16;
		work_hours[0] = 0;
		work_hours[1] = 0;
		work_hours[2] = 0;
		write_eeprom();
		return;
	}
	index-=2;
	flash_mem = (flash_struct*)&eeprom_array[index];
	preset_pre_time = flash_mem->settings.pre_time ;
	preset_cool_time = flash_mem->settings.cool_time;
	controller_address = flash_mem->settings.addresse & 0x0f;
	work_hours[0] = flash_mem->time.hours_h;
	work_hours[1] = flash_mem->time.hours_l;
	work_hours[2] = flash_mem->time.minutes;
}

void write_eeprom(void){
	volatile int index = 0;
	FLASH_Unlock();
	volatile flash_struct flash_mem;
	uint32_t *p = (uint32_t *)eeprom_array;
//	uint32_t *p = (uint32_t *)&flash_mem;
	for(index = 0; index<512; index+=2){
		if(*(p + index)==0xFFFFFFFF) break;
	}

//	while((eeprom_array[index]!=0xFFFFFFFFUL)&&(index<(512)))index+=2;
	if(index > 511){
		// No more room. Erase the 4 pages
		FLASH_ErasePage((uint32_t)&eeprom_array[0]);
		FLASH_ErasePage((uint32_t)&eeprom_array[128]);
		FLASH_ErasePage((uint32_t)&eeprom_array[256]);
		FLASH_ErasePage((uint32_t)&eeprom_array[384]);
		index = 0;
	}
	for(index = 0; index<512; index+=2){
		if(*(p + index)==0xFFFFFFFF) break;
	}
	if(index >511){
		display_data = 0xE01;
		for (index = 0; index<20; index++){
			clear_notes();

			push_note(E2,3);
			push_note(D4,3);
		}
	} else {
		volatile static FLASH_Status sts;
		p = (uint32_t *)&flash_mem;
		flash_mem.settings.pre_time = preset_pre_time;
		flash_mem.settings.cool_time = preset_cool_time;
		flash_mem.settings.addresse = controller_address & 0x0f;
		flash_mem.settings.unused = 0x55;
		flash_mem.time.hours_h = work_hours[0];
		flash_mem.time.hours_l = work_hours[1];
		flash_mem.time.minutes = work_hours[2];
		flash_mem.time.used_flag = 0;
		sts = FLASH_ProgramWord((uint32_t)&eeprom_array[index],p[0]);
		sts = FLASH_ProgramWord((uint32_t)&eeprom_array[index+1],p[1]);
		index = sizeof(flash_mem);
		index ++;
		sts = sts;
	}
	FLASH_Lock();
}

